# **DataFrames**
> ## **Dados Ausentes**
> *Dados ausentes em DataFrentes e como defini-los, preenche-los*
>

In [1]:
import numpy as np
import pandas as pd

> Definindo d como um dicionario com alguns valores NaN, utilizando o np.nan para defini-los, o que permitirá a manipulação deles

In [2]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

> Definindo df como um DataFrame com d como data

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

> Utilizando dropna para eliminar os indices que possuem valores NaN

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

> Utilizando dropna para eliminar indices que possuem pelo menos dois valores NaN

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

> Preenchendo NaN com a string 'Fill na'

In [8]:
df.fillna(value='Fill na')

         A        B  C
0      1.0      5.0  1
1      2.0  Fill na  2
2  Fill na  Fill na  3

> Preenchendo os valores NaN na coluna A como a média dos valores da mesma

In [9]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

> Utilizando o metodo foward fill (ffill()), para prencher os valores NaN com o valor que o antecede no axis padrão

In [13]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3